Revit 2027 API
PointLightShape Constructor
Overload List
Name | Description
PointLightShape() |  Creates a point light shape object.
PointLightShape(PointLightShape) |  Creates a copy of the given point light shape
Top
See Also
Reference
PointLightShape Class
Autodesk.Revit.DB.Lighting Namespace